b = 1
c = 0
v = int(input('Сколько цифр: '))
while b <= v:
    n = list(input(f'Цифра под номером {b}:'))
    b += 1
    c += 1
print(f'Минимальное число:{min(n)}')

# check out babe
